 // элементы на старте
 var stats = [{
  label: "Приготовить завтрак"
},
{
  label: "Погулять с собакой"
},
{
  label: "Сделать курсач"
},
];


// создаём новое приложение Vue.js
new Vue({
// привязываем его к блоку на странице по id
el: "#demo",
// стартовые значения приложения
data: {
  newLabel: "",
  stats: stats
},
// объявляем методы — что будет уметь наше приложение
methods: {
  // добавить новый элемент
  add: function(e) {
      e.preventDefault();
      // если не нажата кнопка «Добавить направление» — выходим из метода
      if (!this.newLabel) return;
      this.stats.push({
          // иначе — добавляем новый элемент и присваиваем ему значение по умолчанию
          label: this.newLabel,
      });
      // очищаем поле ввода
      this.newLabel = "";
  },
  // удалить элемент
  remove: function(stat) {
      // если элементов больше трёх
      if (this.stats.length > 0) {
          // удаляем выбранный
          this.stats.splice(this.stats.indexOf(stat), 1);
      } else {
          // иначе выводим сообщение
          alert("Должно остаться как минимум три направления");
      }
  }
}
});